<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of TNEF's Enough.</string>
    <key>Identifier</key>
    <string>com.github.jcip02.autopkg.download.tnefsenough</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>tnefsenough</string>
        <key>DOWNLOAD_PAGE_URL</key>
        <string>http://www.joshjacob.com/mac-development/tnef.php</string>
        <key>DOWNLOAD_ROOT_URL</key>
        <string>http://www.joshjacob.com/mac-development</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_PAGE_URL%</string>
                <key>re_pattern</key>
                <string>(?P&lt;file&gt;TNEF[0-9\.]*dmg)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_ROOT_URL%/%file%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>