<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of TNEF's Enough.</string>
    <key>Identifier</key>
    <string>com.github.jcip02.autopkg.munki.tnefsenough</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>tnefsenough</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>utilites</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>TNEF's Enough allows Macs to read and extract files from Microsoft TNEF stream files. The files are usually received by SMTP based e-mail programs from Microsoft Exchange and Microsoft Outlook users. The SMTP based e-mail program will usually receive either a MIME attachment named "winmail.dat" or a MIME attachment with the type "application/ms-tnef."</string>
            <key>display_name</key>
            <string>TNEF's Enough</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jcip02.autopkg.download.tnefsenough</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>