<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Workgroup Manager disk image for 10.8.</string>
    <key>Identifier</key>
    <string>com.github.jcip02.autopkg.munki.WorkgroupManager.10.8</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>WorkgroupManager10.8</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>servertools</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>To manage client preferences with OS X Server, use Workgroup Manager 10.8 on OS X Mountain Lion.</string>
            <key>display_name</key>
            <string>Workgroup Manager 10.8</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jcip02.autopkg.download.WorkgroupManager.10.8</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>